Revit 2027 API
RebarConstraint.SetToBindHandleWithTarget Method
 Sets the relationship between two RebarConstrainedHandles.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetToBindHandleWithTarget(
	bool bindsHandleWithTarget
)
Public Sub SetToBindHandleWithTarget (
	bindsHandleWithTarget As Boolean
)
public:
void SetToBindHandleWithTarget(
	bool bindsHandleWithTarget
)
member SetToBindHandleWithTarget :
        bindsHandleWithTarget : bool -> unit
Parameters
bindsHandleWithTarget Boolean
 False if only the constrained RebarConstrainedHandle follows the target. True if the constrained RebarConstrainedHandle and the target bar handle will be bound and move together.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- Constrained rebar isn't a Shape Driven Rebar element. -or- The TargetRebarConstraintType is 'HookBend' or 'BarBend'. -or- The TargetRebarConstraintType is 'OutOfPlaneExtent' and the rebar target layout is either 'Number with Spacing' or 'Custom Spacing with non-variable formula'.
Remarks
Throws exception for any type of constraint other than 'ToOtherRebar' or if the TargetRebarConstraintType of the constraint is 'HookBend' or 'BarBend'.
Will also throw if the target Rebar has the 'Number with Spacing' layout rule and the TargetRebarConstraintType of the constraint is 'OutOfPlaneExtent'.
Will throw if the target Rebar has the 'CustomSpacing' layout and the formula wil not permit to have a draggable 'OutOfPlaneExtent'.
Throws exception if the constraint is for a handle of a Free Form Rebar.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace